import 'package:flutter/material.dart';

class Localization {
  Localization(this.locale);

  final Locale locale;

  static Localization of(BuildContext context) {
    return Localizations.of<Localization>(context, Localization);
  }

  static Map<String, List> _localizedValues = {
    'en': [
      "First name",
      "Last name",
      "email",
      "Identity card number",
      "Password",
      "Password confirmation",
      "Phone",
      "Gender",
      "Male",
      "Female",
      "This field is required",
      "Name must be two characters at least",
      "This email is invalid",
      "Identity card must be 9 digits",
      "Password must be 8 characters at least",
      "Password Confirmation must match password",
      "Register as a new user",
      "Login",
      "Don't have an account ? Register now !",
      "Exercises",
      "My exercises",
      "My profile",
      "Types of exercises",
      "Users",
      "Send notices",
      "Identity cards",
      "The images",
      "About us",
      "There are no exercises you plan to attend at the moment",
      "Title",
      "Body",
      "Male",
      "Female",
      "Maximum number of subscribers",
      "Date",
      "Start Time",
      "End Time",
      "Attachments",
      "Image",
      "Exercise type",
      "Language",
      "Height",
      "Weight",
      "January",
      "February",
      "March",
      "April",
      "May",
      "June",
      "July",
      "August",
      "September",
      "October",
      "November",
      "December",
      "Mon",
      "Tue",
      "Wed",
      "Thu",
      "Fri",
      "Sat",
      "Sun",
      "Are you sure ?",
      "Yes",
      "No",
      'Started',
      'Ended',
      'Join',
      'Leave',
      'Full',
      'Log out',
      'Details',
      'Users',
      'Max subscribers',
      'Date',
      'Start time',
      'End time',
      'Enable reminder',
      'Details',
      'More',
      'Show more',
      'Show less'
    ],
    'ar': [
      "الاسم الأول", //0

      "الكنية", //1

      "البريد الإلكتروني", //2

      "رقم بطاقة الهوية", //3

      "كلمه السر", //4

      "تأكيد كلمة المرور", //5

      "هاتف", //6

      "جنس", //7
      "ذكر", //8
      "أنثى", //9
      "هذه الخانة مطلوبه", //10
      "الاسم يجب أن يتكون من حرفين على الأقل", //11
      "هذا البريد الإلكتروني غير صالح", //12
      "يجب أن تتكون بطاقة الهوية من 9 أرقام", //13
      "كلمة المرور يجب أن تتكون من 8 أحرف على الأقل", //14
      "يجب أن يتطابق تأكيد كلمة المرور مع كلمة المرور", //15
      "التسجيل كمستخدم جديد", //16
      "تسجيل الدخول", //17
      "ليس لديك حساب؟ سجل الآن!", //18
      "تمارين", //19
      "تماريني", //20
      "ملفي", //21
      "أنواع التمارين", //22
      "المستخدمون", //23
      "إرسال الإخطارات", //24
      "بطاقات هوية", //25
      "الصور", //26
      "معلومات عنا", //27
      "لا توجد تمارين تنوي حضورها في الوقت الحالي", //28
      "لقب", //29
      "الجسم", //30
      "ذكر", //31
      "أنثى", //32
      "الحد الأقصى لعدد المشتركين", //33
      "تاريخ", //34
      "وقت البدء", //35
      "وقت النهاية", //36
      "المرفقات", //37
      "صورة", //38
      "نوع التمرين", //39
      "لغة", //40
      "ارتفاع", //41
      "وزن", //42
      "يناير", //43
      "فبراير", //44
      "مارس", //45
      "أبريل", //46
      "مايو", //47
      "يونيو", //48
      "يوليو", //49
      "أغسطس", //50
      "سبتمبر", //51
      "اكتوبر", //52
      "نوفمبر", //53
      "ديسمبر", //54
      "اثنين", //55
      "ثلاثاء", //56
      "أربعاء", //57
      "خميس", //58
      "جمعة", //59
      "سبت", //60
      "أحد", //61
      "هل أنت متأكد ؟", //62,
      "نعم", //63
      "لا", //64

      'بدأت', //65
      'انتهت', //66
      'انضم', //67
      'غادر', //68
      'ممتلئ', //69
      'تسجيل خروج', //70,
      'تفاصيل', //71
      "المستخدمون", //72
      "اقصى عدد مشتركين", //73
      'تاريخ', //74
      'وقت البدء', //75
      'وقت النهاية', //76
      'تشغيل التذكير', //77,
      'تفاصيل', //78
      'المزيد', //79,
      'عرض المزيد', //80
      'عرض اقل' //81
    ],
    'he': [
      "שם פרטי",
      "שם משפחה",
      "אימיל",
      "מספר תעודת זהות",
      "סיסמה",
      "אימות סיסמה",
      "מספר טלפון",
      "מין",
      "זכר",
      "נקבה",
      "שדה חובה",
      "השם חייב להיות לפחות שתי תווים",
      "האימיל לא קיים",
      "תעודת זהות חייבת להיות בת 9 ספרות",
      "הסיסמה חייבת להיות בת 8 תווים לפחות",
      "אישור סיסמה חייב להתאים לסיסמה",
      "הירשם כמשתמש חדש",
      "התחברות",
      "אין לך חשבון? הירשם עכשיו!",
      "אימונים",
      "האימונים שלי",
      "הפרופיל שלי",
      "סוגי תרגילים",
      "משתמשים",
      "שלח התראות",
      "תעודות זהות",
      "התמונות",
      "עלינו",
      "אין תרגילים שאתה מתכוון להשתתף בהם כרגע",
      "כותרת",
      "גוף",
      "זכר",
      "נקבה",
      "מספר המנויים המרבי",
      "תאריך",
      "שעת התחלה",
      "שעת סיום",
      "קבצים מצורפים",
      "תמונה",
      "סוג התרגיל",
      "שפה",
      "גובה",
      "משקל",
      "ינואר",
      "פברואר",
      "מרץ",
      "אפריל",
      "מאי",
      "יוני",
      "יולי",
      "אוגוסט",
      "ספטמבר",
      "אוקטובר",
      "נובמבר",
      "דצמבר",
      "שני",
      "שלישי",
      "רביעי",
      "חמישי",
      "שישי",
      "שבת",
      "ראשון",
      "האם אתה בטוח ?",
      "כן",
      "לא",
      'התחיל',
      'הסתיים',
      'הצטרף', // 68
      'עזוב', // 69
      'מלא', // 70,
      'התנתק',
      'פרטים',
      'משתמשים',
      "המספר המרבי של מנויים",
      'תאריך',
      'שעת התחלה',
      'שעת סיום',
      'אפשר תזכורת',
      'פרטים',
      'עוד',
      'להראות יותר',
      'הראי פחות'
    ]
  };

  List get languageCode {
    return _localizedValues[locale.languageCode];
  }
}
